package com.buyin.dalili.features.bot.domain.usecase

import android.annotation.SuppressLint

object Answers {
    @SuppressLint("DefaultLocale")

    fun Questions(_message: String): String {
        val message = _message.toLowerCase()
        return when {
            message.contains("grants and loans") || message.contains("منح التعليم العالي")
                    || message.contains("منح") || message.contains("التعليم العالي") ||
                    message.contains("منح و قروض")
            -> {
                "ادخل على موقع مديرية البعثات \n" +
                        "http://dsamohe.gov.jo/internal/\n" +
                        "تاكد من موعد التقديم حيث في المجمل\n" +
                        "التقديم يبداء في منتصف الفصل الاول \n" +
                        "من العام الدراسي,ثم على تقديم للقوض و المنح \n" +
                        "و التي تتطلب منك :\n" +
                        "1-ادخال رقمك الوطني و رقم القيد\n" +
                        "2- ادخال رقمين هاتف \n" +
                        "3-تحديد معدلك في الثانوية العامة\n" +
                        "4- اختيار اسماء الاخوة الملتحقين في جامعات حكومية\n" +
                        "5-ثم يطلب منك وضع رقم سري\n" +
                        "\n"
            }
            message.contains("hashemite university loans") || message.contains("منح الجامعة الهاشمية")
                    || message.contains("منح الجامعة") || message.contains("المنح الداخلية")
            -> {
                "1-الدخول الى بوابة الطالب الجامعي من خلال الرابط\n" +
                        "https://reg1.hu.edu.jo/\n" +
                        "2- اختيار عمادة شؤون الطلبة-->طلب قرض \n" +
                        "3-ادخال عدد أفراد الأسرة مع\n" +
                        " الأب والأم (بإستثناء المتزوجين)\n" +
                        "4-ترتيب الطالب في الأسرة\n" +
                        "5-الوضع الصحي للاب\n" +
                        "6-تحديد المعيل و اسمه\n" +
                        " و مصدر دخله ومقدار الدخل\n" +
                        "7-ادخال عدد افراد الأسرة في الكليات \n" +
                        "والجامعات (على حساب الأسرة )\n" +
                        "8-تحديد اذا سبق و حصلت على قرض\n" +
                        "9- ادخال قيمة القرض و ارسال الطلب"
            }
            message.contains("forgotb email password") || message.contains("نسيان الرقم السري")
                    || message.contains("تعيين رقم سري") || message.contains("الرقم السري")
                    || message.contains("الرقم السري للبريد الالكتروني")
            -> {
                "1-الدخول الى بوابة الطالب الجامعي من خلال الرابط\n" +
                        "https://reg1.hu.edu.jo/\n" +
                        "2-اختر خدمات اخرى -->تغيير\n" +
                        " كلمة سر البريد الالكتروني\n" +
                        "3-ادخال الكليمة الجديدة و اعتماد الطلب"
            }
            message.contains("proof sheet") || message.contains("اثبات طالب")
                    || message.contains("ورقة اثبات طالب")
            -> {
                "1- من بوابة الطالب اختر خدمات مالية\n" +
                        "2- اختر دفع رسوم متفرقة\n" +
                        "3-اختر من البند اثبات طالب \n" +
                        "4-حدد عدد النسخ \n" +
                        "5- ثم اذهب الى مبنى القبول و التسجيل\n" +
                        "في الجامعة للحصول على النسخة الورقية"
            }
            message.contains("email of the university employees") ||
                    message.contains("بريد عاملين في الجامعة")
                    || message.contains("ايميل دكتور")
            -> {
                "1-ادخل على الرابط التالي:\n" +
                        "https://tel.hu.edu.jo/\n" +
                        "2-ادخل اسم العامل المطلوب لتجد خانة البريد بجانب اسمه"
            }
            message.contains("drop course") || message.contains("سحب مادة")
                    || message.contains("اسقاط مادة")
            -> {
                "1- من بوابة الطالب اختر خدمات مالية\n" +
                        "2-من خيار العلامات اختر طلب الانسحاب من مادة\n" +
                        "3-اختر المادة المراد اسقاطها"
            }
            message.contains("standard admission") || message.contains("القبول الموحد") ||
                    message.contains("قبول الجامعة الهاشمية") || message.contains("قبول الجامعة")
            -> {
                "الخطوة الأولى\n" +
                        ": إنشاء مستخدم جديد\n" +
                        ". لأول مرّة ولمرّة واحدة فقط،\n" +
                        " ستقوم بإنشاء مستخدم جديد باستخدام رقمك الوطني، وستقوم بإنشاء كلمة مرور\n" +
                        " (password) من اختيارك، ومن ثم إدخال رقم الهاتف الجوال الخاص ب\n" +
                        "ك. الخطوة الثانية: إدخال معلومات الشهادة الثانوية.\n" +
                        " بعد إنشائك مستخدم جديد، ستقوم بإدخال مصدر الثانوية (جنسية الشهادة)\n" +
                        " وسنة الحصول عليها، وفرع ومٌعدّل الشهادة الثانوية. الخطوة الثالثة: اختيار التخصصات التي ترغب بالالتحاق بها."
            }
            message.contains("الموازي") || message.contains("تسجيل الموازي") -> {
                "كون التقديم لبرنامج الموازي للطلاب الأردنيين والفلسطينيين وأبناء الأردنيات\n" +
                        " 1. التأكد من مطابقة شروط الالتحاق بالبرنامج المواز\n" +
                        " 2. تقديم طلب التحاق الكتروني عبر الرابط الذي تعتمده وتنشره الجامعات وتسديد\n" +
                        " الرسوم الطلب من خلال فروع البنوك الأردنية وأجهزة الصراف الالي التابعة لها أو نقاط البيع التي تقدم خدمة (إي فواتيركم). 3\n" +
                        ". انتظار قوائم المقبولين على موقع القبول والتسجيل الخاص بكل\n" +
                        " جامعة حيث يتم إصدار قوائم القبول على دفعات متتالية. 4.\n" +
                        " يتم إرسال رسالة نصية لكل طالب تم قبوله في البرنامج الموازي رقم الهاتف المرفق بالطلب. 5\n" +
                        "في حالة القبول: يتم إحضار الأوراق الثبوتية المطلوبة مصدقة حسب الأصول ومتابعة \n" +
                        "الإجراءات مع القبول والتسجيل للحصول على اسم المستخدم وكلمة السر ورقم الدفع الإلكتروني. 6.\n" +
                        " تعبئة البيانات الشخصية للطالب من خلال موقع التسجيل الذاتي. 7\n" +
                        ". تسديد الرسوم المطلوبة من خلال فروع البنوك الأردنية وأجهزة الصراف الآلي التابعة لها أو نقاط البيع والأكشاك التي تقدم خدمة إي فواتيركم. 8.\n" +
                        " متابعة الإعلانات على موقع الجامعة لمعرفة تاريخ التقدم لامتحانات الكفاءة (اللغة العربية والإنجليزية والحاسوب) 9.\n" +
                        " يتم تحضير الجدول الدراسي للطالب خلال 24 ساعة من تقديم الامتحان بناءّ على نتائج الامتحان.\n" +
                        " 10. إصدار الهوية الجامعية.\n"
            }
            message.contains("نبذة عن الجامعة") || message.contains("الجامعة الهاشمية")
                    || message.contains("نبذة عن الجامعةالهاشمية") -> {
                "الجامعة حكومية \n" +
                        "التأسيس: عام 1991 م.\n" +
                        "\n" +
                        "الموقع: الزرقاء.\n" +
                        "\n" +
                        "مساحة الجامعة: 8519 دونم.\n" +
                        "\n" +
                        "حالة المواصلات: جيدة جدا.\n" +
                        "\n" +
                        "التصنيف العالمي: 2011 عالميا.\n" +
                        "\n" +
                        "التصنيف المحلي: المركز الخامس محلي، 38 عربي. \n" +
                        "\n" +
                        "عدد التخصصات: 52 بكالوريوس، 35 برنامج الدراسات العليا بالإضافة الى دبلوم مهني.\n" +
                        "\n" +
                        "عدد الكليات: 16 كلية.\n" +
                        "\n" +
                        "عدد الطلاب: 28 ألف طالب تقريبا. \n" +
                        "\n" +
                        "يتوفر سكن داخل الجامعة للإناث: لا \n" +
                        "\n" +
                        "أفضل المكتبة: مكتبة الجامعة. \n" +
                        "\n" +
                        "أفضل مطعم: مطاعم كلية الطب. \n" +
                        "\n" +
                        "أشهر معلم موجود بالجامعة: الحلزونة، النافورة، مبنى الصيدلية. \n" +
                        "\n" +
                        "رقم هاتف: +962 -5-3093333\n" +
                        "\n" +
                        "الحرم الجامعي: \n" +
                        "\n" +
                        "يحتوي الحرم الجامعي على مكتبة و3 عمادة وكليات ومطاعم وفرع البنك وحضانة، مركز صحي."
            }
            message.contains("بوابة الطالب") || message.contains("البوابة") -> {
                "https://reg1.hu.edu.jo/"
            }
            message.contains("Model ") || message.contains("المودل") || message.contains("مودل")
            -> {
                "https://mlms.hu.edu.jo/"
            }
            else -> {
                val random = (0..3).random()

                when (random) {
                    0 -> {
                        "حدث خطأ ما حاول مجددا"
                    }
                    1 -> {
                        "هناك مشكلة ما هل يمكنك التوضيح"

                    }
                    2 -> {
                        "لا يمكنني فهمك يا صديقي"
                    }
                    else -> {
                        "هل حقا تعرف الكتابة؟"
                    }
                }
            }


        }


    }
}


